class Square {
    constructor(a) {
        this.a = a;
    }

    static help() {
        console.log(`
Визначення:
Квадрат - це геометрична фігура, яка має чотири однакові сторони та чотири кути, що рівні 90 градусів.

Основні Властивості:
- Рівні Сторони: У квадрата всі чотири сторони рівні між собою. Це означає, що довжина будь-якої сторони квадрата дорівнює довжині будь-якої іншої сторони.
- Прямокутні Кути: У квадрата кожен кут є прямим кутом, що має велике значення при вирішенні геометричних завдань та розрахунках.
- Діагоналі: Діагоналі квадрата - це відрізки, які з'єднують протилежні вершини. У квадрата діагоналі рівні між собою та перпендикулярні.
- Співпадаючі Бісектриси та Медіани: Бісектриси кутів та медіани (відрізки, які з'єднують кожну вершину з серединою протилежної сторони) у квадрата є співпадаючими.
- Співпадаючі Катети: У квадрата катети (сторони, які утворюють прямий кут) також є рівні між собою.`);
    }
    length() {
        console.log(this.a * 4);
    }

    square() {
        console.log(this.a ** 2);
    }

    info() {
        console.log(`- довжини всіх 4 сторін = ${this.a};
        - величини всіх 4 кутів = 90°;
        - суму довжин сторін = ${this.a * 4};
        - площу ${this.a**2}.`);
    }
}

class Rectangle extends Square {
    constructor(a, b) {
        this.a = a;
        this.b = b;
    }

    static help() {
        console.log(`
Визначення:
Прямокутник - це геометрична фігура, яка характеризується чотирма прямими кутами та протилежними сторонами, які паралельні та рівні за довжиною.

Основні Властивості:
- Прямі кути: У прямокутнику кожний внутрішній кут має рівність 90 градусів, що робить його прямокутником.
- Протилежні сторони рівні: Протилежні сторони прямокутника паралельні одна одній і мають однакову довжину. Це робить його рівнобедреним чотирикутником.
- Паралельні сторони: Дві пари протилежних сторін прямокутника є паралельними, що означає, що вони ніколи не перетинаються.
- Діагоналі: Прямокутник має дві діагоналі, які є відрізками, що з'єднують протилежні вершини. Діагоналі прямокутника мають однакову довжину і ділять його на дві рівні прямокутні трикутники.`);
    }
    length() {
        console.log(this.a * 2 + this.b * 2);
    }

    square() {
        console.log(this.a * this.b);
    }

    info() {
        console.log(`- довжини перших 2 сторін = ${this.a}, інших 2 сторін = ${this.b};
        - величини всіх 4 кутів = 90°;
        - суму довжин сторін = ${this.a * 2 + this.b * 2};
        - площу ${this.a * this.b}.`);
    }
}