class Square {
    constructor(a) {
        this.a = a;
    }

    static help() {
        console.log(`
Визначення:
Квадрат - це геометрична фігура, яка має чотири однакові сторони та чотири кути, що рівні 90 градусів.

Основні Властивості:
- Рівні Сторони: У квадрата всі чотири сторони рівні між собою. Це означає, що довжина будь-якої сторони квадрата дорівнює довжині будь-якої іншої сторони.
- Прямокутні Кути: У квадрата кожен кут є прямим кутом, що має велике значення при вирішенні геометричних завдань та розрахунках.
- Діагоналі: Діагоналі квадрата - це відрізки, які з'єднують протилежні вершини. У квадрата діагоналі рівні між собою та перпендикулярні.
- Співпадаючі Бісектриси та Медіани: Бісектриси кутів та медіани (відрізки, які з'єднують кожну вершину з серединою протилежної сторони) у квадрата є співпадаючими.
- Співпадаючі Катети: У квадрата катети (сторони, які утворюють прямий кут) також є рівні між собою.`);
    }
    length() {
        console.log(this.a * 4);
    }

    square() {
        console.log(this.a ** 2);
    }
}